"use client";

import { Disclosure, DisclosureButton, DisclosurePanel } from '@headlessui/react'
import { MinusCircle, PlusCircle } from 'lucide-react'

const faqs = [
    {
        question: "مسابقه الگوریتم تریدینگ در چه تاریخی برگزار می‌شود؟",
        answer:
            "مسابقه در روزهای ۵  خرداد الی ۷ خرداد برگزار می‌شود. در روزهای ۵ و ۶ خرداد شرکت‌کنندگان می‌توانند الگوریتم‌های خود را روی داده‌های تستی فراهم شده توسط سیستم مسابقه، تست کنند و در نهایت در روز ۷ خرداد الگوریتم نهایی خود را آپلود کنند. در روز ۸ خرداد طی مراسمی برندگان انتخاب می‌شوند.",
    },
    {
        question: "آیا مسابقه به صورت حضوری برگزار می‌شود؟",
        answer: "خیر تمامی مراحل انجام مسابقه صرفاً به صورت آنلاین برگزار می‌شود. تنها روز اختتامیه و اعلام برندگان به صورت حضوری و در دانشگاه امیرکبیر مطابق اطلاع‌رسانی های بعدی پذیرای شرکت کنندگان خواهیم  بود.",
    },
    {
        question: "چگونه می‌توانم در مسابقه ثبت‌نام کنم؟",
        answer: "اطلاعات ثبت‌نام در سایت رسمی مسابقه موجود است.",
    },
    {
        question: "چه مدارکی برای ثبت‌نام لازم است؟",
        answer: "تنها نام و نام خانوادگی، شماره موبایل و ایمیل برای ثبت‌نام کفایت می کند.",
    },
    {
        question: "آیا هزینه‌ای برای شرکت در مسابقه وجود دارد؟",
        answer: "خیر ، تمام سعی ما این بوده که از حضور تمامی افراد استقبال و حمایت کنیم به همین دلیل، نیاز به پرداخت هیچ  هزینه ای برای ثبت نام نمی باشد.",
    },
    {
        question: "چه نوع الگوریتم‌هایی مجاز به شرکت در مسابقه هستند؟",
        answer: "الگوریتمی که بتوان آن را به زبان پایتون پیاده سازی کرد!",
    },
    {
        question: "از چه پلتفرم یا زبانی برای نوشتن الگوریتم‌ها باید استفاده کنم؟",
        answer: "کد ها باید در سایت رسمی داوری مسابقه که از روز مسابقه در دسترس شرکت کنندگان قرار می گیرد، آپلود  شود. در اولین دوره مسابقه تنهامجاز به استفاده از زبان پایتون هستید . برای دوره های بعدی زبان‌های بیشتری قابل استفاده خواهد بود.  همچنین سینتکس داوری مسابقه بر مبنای backtesting.py  می‌باشد که لازم است شرکت کنندگان مستندات آن را در طی دو روز تست بررسی کنند تا برای روز اصلی مسابقه بتوانند بر مبنای آن کدهای خود را آپلود کنند.",
    },
    {
        question: "چگونه و کجا باید کدهای الگوریتم خود را آپلود کنم؟",
        answer: "در طول دوره مسابقه ، از طریق سایت داوری و بر اساس توضیحات موجود  در سایت می‌توانید کدهای خود را آپلود کنید.",
    },
    {
        question: "آیا محدودیتی برای تعداد دفعات آپلود کدها وجود دارد؟",
        answer: "در طول دو روز اول که دوره تست می‌باشد می‌توانید بر اساس زمان بندی تنظیم شده هر ۱۵ دقیه یکبار ، کدهای خود را آپلود و نتیجه آن را مشاهده کنند. در روز سوم مسابقه ، فقط یکبار امکان آپلود نهایی کد خود را دارید.",
    },
    {
        question: "داده‌های کریپتوکارنسی برای تست الگوریتم‌ها چگونه تأمین می‌شود؟",
        answer: "داده‌های مسابقه از طریق سیستم داوری مسابقات تأمین می‌شود و برای تمامی شرکت کنندگان در یک سطح و یک تایم فریم و با مشخصات یکسان انتخاب می شود.",
    },
    {
        question: "الگوریتم‌ها بر روی چه داده‌هایی اجرا می‌شوند؟",
        answer: "جفت ارز انتخابی و تایم فریم و همین‌طور بازه زمانی انتخابی ،‌بخشی از شرایط مسابقه می‌باشد و امکان اعلام آن وجود ندارد. بازار مورد نظر این مسابقه بازار کریپتوکارنسی است.",
    },
    {
        question: "چه معیارهایی برای ارزیابی عملکرد الگوریتم‌ها در نظر گرفته می‌شود؟",
        answer: "در هر لیگ، شاخص آن لیگ معیار ارزیابیست.",
    },
    {
        question: "قوانین مربوط به استفاده از داده‌ها و منابع خارجی چیست؟",
        answer: "می توان از داده خارجی استفاده کرد، به شرطی بتوان آن را درون یک لیست و در قالب یک فایل پایتون بر روی جاج بارگزاری کرد. ",
    },
    {
        question: "جوایز برندگان مسابقه چیست؟",
        answer: "جایزه هر لیگ، بین نفرات اول، دوم و سوم با توجه به امتیاز کسب شده تقسیم می شود. ",
    },
    {
        question: "برنده‌ها چگونه و کی اعلام می‌شوند؟",
        answer: "برندگان در روز اختتامیه، مورخ سه‌شنبه ۸ خرداد ماه در طی مراسمی با حضور ریاست محترم دانشگاه صنعتی امیرکبیر و جمعی از صاحبان کسب‌کار به برندگان اهدا می‌شود.",
    },
    {
        question: "آیا پس از مسابقه امکان دسترسی به نتایج و ارزیابی عملکرد الگوریتم‌ها وجود دارد؟",
        answer: "برای هر شرکت کننده فقط امکان دسترسی به عملکرد استراتژی خودش  وجود دارد و استراتژی هر شرکت کننده به سایر افراد نشان داده نمی شود. ",
    },
    {
        question: "چه اقداماتی برای حفظ امنیت و محرمانگی کدهای آپلود شده انجام می‌شود؟",
        answer: "کدهای ارسال شده نزد دانشکده ریاضی و علوم کامپیوتر محفوظ خواهد بود و در اختیار هیچکس قرار نخواهد گرفت",
    },
    {
        question: "آیا الگوریتم‌ها باید به صورت مستقل عمل کنند یا می‌توانند به اینترنت متصل شوند؟",
        answer: "اتصال به اینترنت  و استفاده از منابع خارجی به صورت آنلاین ، در این مسابقه مجاز نیست.",
    },
    {
        question: "آیا محدودیت زمانی برای اجرای الگوریتم‌ها وجود دارد؟",
        answer: "خیر ، سرعت اجرای الگوریتم، مادامی که در طول دوره مسابقه بتواند خروجی مورد نظر را به سیستم داوری اعلام کند، مهم نیست.",
    },
    {
        question: "چگونه می‌توانم با تیم پشتیبانی مسابقه تماس بگیرم؟",
        answer: "اطلاعات تماس با تیم پشتیبانی مسابقه در سایت رسمی مسابقه قرار دارد.",
    },
    {
        question: "اگر در هنگام آپلود یا اجرای کد با مشکلی مواجه شدم، چه باید بکنم؟",
        answer: "با تیم پشتیبانی تماس بگیرید. اطلاعات تماس با تیم پشتیبانی مسابقه در سایت رسمی مسابقه قرار دارد.",
    },
    {
        question: "آیا می‌توانم به صورت تیمی در مسابقه شرکت کنم؟",
        answer: "بله ، هر تیم می‌تواند از طریق یک سرپرست در مسابقه شرکت کند.",
    },
    {
        question: "آیا محدودیتی در تعداد اعضای تیم وجود دارد؟",
        answer: "خیر محدودیتی در تعداد شرکت کنندگان برای یک تیم وجود ندارد ، از نظر سیستم مسابقه هر تیم یک سرپرست دارد و برای دیگر اعضا محدودیتی ندارد.",
    },
    {
        question: "آیا محدودیتی در استفاده از کتابخانه‌ها و ابزارهای خارجی وجود دارد؟",
        answer: "بله، امکان استفاده از تعداد محدودی لایبرری وجود دارد.",
    },
]

export default function FAQ() {
    return (
        <div className="w-full bg-white py-12 sm:py-24" id="faq">
            <div className="w-full mx-auto max-w-7xl px-6 lg:px-8">
                <h2 className="text-3xl font-bold text-gray-900 mb-5">سوالات متداول</h2>
                <dl className="mt-10">
                    {faqs.map((faq, index) => (
                        <Disclosure as="div" key={index} className="pt-6">
                            {({ open }) => (
                                <>
                                    <dt>
                                        <DisclosureButton className="flex w-full items-start justify-between text-left text-gray-900 p-3 border shadow-sm rounded-lg">
                                            <span className="text-base font-semibold leading-7">{faq.question}</span>
                                            <span className="mr-6 flex h-7 items-center text-teal-700">
                                                {open ? (
                                                    <MinusCircle className="h-6 w-6" aria-hidden="true" />
                                                ) : (
                                                    <PlusCircle className="h-6 w-6" aria-hidden="true" />
                                                )}
                                            </span>
                                        </DisclosureButton>
                                    </dt>
                                    <DisclosurePanel as="dd" className="mt-2 pr-3 pl-12">
                                        <p className="text-base leading-7 text-gray-600">{faq.answer}</p>
                                    </DisclosurePanel>
                                </>
                            )}
                        </Disclosure>
                    ))}
                </dl>
            </div>
        </div>
    )
}
